# AICP Internship Task Week 2

<b>Q.1: Writer pandas series code to get following output without using dictionary:
<b>

In [3]:
import pandas as pd
import numpy as np

C:\Users\DELL 5490\AppData\Local\Temp\ipykernel_9644\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
ser=pd.Series(data=[1,4,9,6,7],index=['a','x','c',2,'e'])
print(ser)
ser.dtype

a    1
x    4
c    9
2    6
e    7
dtype: int64

dtype('int64')

<b>Q.2: Writer pandas series code to get following output using dictionary:
<b>

In [5]:
d={'Bilal':42,'Ayesha':38,'hadia':39}
ser=pd.Series(d)
ser

Bilal     42
Ayesha    38
hadia     39
dtype: int64

<b>Q.3: Write pandas dataframe code to get following output using python dictionary
<b>

In [6]:
df=pd.DataFrame({
    'day':pd.date_range("010117",periods=6),
    'temperature':[32,35,28,24,32,31],
    'windspeed':[6,7,2,7,4,2],
    'event':['Rain','Sunny','Snow','Snow','Rain','Sunny']

})
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow
3 2017-01-04           24          7   Snow
4 2017-01-05           32          4   Rain
5 2017-01-06           31          2  Sunny

<b>Q.4: In extension to above question, you are required to replace index by ['a','b','c','d','e','f']<b>

In [7]:
df=pd.DataFrame({
    'day':pd.date_range("010117",periods=6),
    'temperature':[32,35,28,24,32,31],
    'windspeed':[6,7,2,7,4,2],
    'event':['Rain','Sunny','Snow','Snow','Rain','Sunny']
},
index=['a','b','c','d','e','f']
)
df

         day  temperature  windspeed  event
a 2017-01-01           32          6   Rain
b 2017-01-02           35          7  Sunny
c 2017-01-03           28          2   Snow
d 2017-01-04           24          7   Snow
e 2017-01-05           32          4   Rain
f 2017-01-06           31          2  Sunny

<b>Q6: In extension to above Q.3, calculate mean, miximum and minimum for label “temperature<b>

In [8]:
mean=df['temperature'].mean()
print(mean)
max=df['temperature'].max()
print(max)
min=df['temperature'].min()
print(min)

30.333333333333332
35
24

<b>Q.6: Import CSV ‘people.csv’ in the given folder. Keep in mind the following instructions:
You’re required to import only specific columns ["First Name", "Sex", "Email", “Phone”, “Job Title”]
Set the following columns ["Sex", "Job Title"] as index columns
Skip following rows [1,5]
Export the CSV as “NewPeople.csv”<b>

In [9]:
df=pd.read_csv('people.csv',usecols=["First Name", "Sex", "Email", 'Phone', 'Job Title'],index_col= ["Sex", "Job Title"],skiprows=[1,5])
pd.DataFrame.to_csv(df,"NewPeople.csv")

<b>Q.7: Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions:
<ol><li>Import sheet 1<li>
Import only first and last column from sheet 1<li>
Skip row 2 while importing the sheet<li>
Set row 2 as header<li>
export as new sheet.<ol><b>

In [ ]:
dfs=pd.read_excel("SampleWork.xlsx",sheet_name=['Sheet1'],usecols=[0,3],skiprows=[1],header=[1])
df = dfs['Sheet1']
with pd.ExcelWriter("SampleWork.xlsx",mode='a') as writer:  
    df.to_excel(writer, sheet_name='Sheet_name_3')

<b>
Q.8: Create the following dataframe as AICP_DF then implement different operations as described below:<li>
select 'Name', 'Qualification' coloumns and save to df1<li>
add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1]<li>
set column “Name” as the index column.<li>
retrieve row with index “Hifza”<li>
retrieve row with index 3<li>
drop row with index “Bilal
<b>

In [17]:
AICP_DF=pd.DataFrame({
    'Name':['Sonia','Bilal','Hifza','Kabir','Jazim'],
    "Age":[27,24,22,32,23],
    "Address":['Lahore','Karachi','Sialkot','Peshawar','lhr'],
    "Qualification":['Msc','MA','MCA','Phd','bsc']
}
)
AICP_DF

    Name  Age   Address Qualification
0  Sonia   27    Lahore           Msc
1  Bilal   24   Karachi            MA
2  Hifza   22   Sialkot           MCA
3  Kabir   32  Peshawar           Phd
4  Jazim   23       lhr           bsc

In [18]:
AICP_DF.insert(4,'Height', [5.1, 6.2, 5.1, 5.2,5.1])

In [19]:
AICP_DF.index.dtype

dtype('int64')

In [26]:
AICP_DF.set_index('Name',inplace=True)

In [27]:
AICP_DF.index.dtype

dtype('O')

In [28]:
x=AICP_DF.loc['Hifza']
x

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [29]:
AICP_DF.iloc[3]

Age                    32
Address          Peshawar
Qualification         Phd
Height                5.2
Name: Kabir, dtype: object

In [30]:
AICP_DF.drop(index='Bilal', inplace=True)

In [31]:
AICP_DF

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           Msc     5.1
Hifza   22   Sialkot           MCA     5.1
Kabir   32  Peshawar           Phd     5.2
Jazim   23       lhr           bsc     5.1